### Pandas-dataframe and series 

-powerful data manipulation library


-used for data analysis and data cleaning 


-primary data structures : series and dataframe

In [ ]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

#### series

In [3]:
# it is 1d array that can hold any data type similar to a column in table 

data = [1,2,3,4,5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
#create a series from dictionary 
data = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data)
print(series_dict)
print(type(series_dict))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
data = [10,20,30]
index = ['a', 'b', 'c']
data_Series = pd.Series(data, index=index)
print(data_Series)
print(type(data_Series))

a    10
b    20
c    30
dtype: int64
<class 'pandas.core.series.Series'>

#### dataframe

In [8]:

#A DataFrame is a 2D, labeled data structure with rows and columns, where:

# Rows typically represent individual data samples (like customers, transactions, etc.).

# Columns represent features/attributes (like age, income, category, etc.)

In [14]:
#create a dataframe from dictionary of list 

data = {
  'Name':['Alice', 'Bob', 'Charlie'],
  'Age':[25, 30, 35],
  'City':['New York', 'Los Angeles', 'Chicago'],


}

df = pd.DataFrame(data)
print(df)
print(type(df))

# ser = pd.Series(data)
# print(ser)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
<class 'pandas.core.frame.DataFrame'>

In [17]:
import numpy as np 

arr = np.array(df)
print(arr)

[['Alice' 25 'New York']
 ['Bob' 30 'Los Angeles']
 ['Charlie' 35 'Chicago']]

In [18]:
#create a dataframe from list of dictionaries

data= [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}

  
]

df = pd.DataFrame(data)
print(df) 
print(type(df))

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
<class 'pandas.core.frame.DataFrame'>

In [ ]:
df = pd.read_csv('sales_data.csv')
print(df.head())  # Display the first few rows of the DataFrame
print(df.head(10))

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal
   Transaction ID        Date Product Category                 Product Name  \
0           10001  2024-01-01      Electronics                iPhone 14 Pro
1           10002  2024-01-02  Home Appliances             Dyson V11 Vacuum
2           10003  2024-01-03         Clothing             Levi's 501 Jeans
3           10004  2024-01-04            Books            The Da Vinci Code
4           10005  2024-01-05  Beauty Products      Neutrogena Skincare Set
5           10006  2024-01-06           Sports  Wilson Evolution Basketball
6           10007  2024-01-07      Electronics          MacBook Pro 16-inch
7           10008  2024-01-08  Home Appliances         Blueair Classic 480i
8           10009  2024-01-09         Clothing             Nike Air Force 1
9           10010  2024-01-10            Books        Dune by Frank Herbert

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal
5           5       29.99         149.95           Asia    Credit Card
6           1     2499.99        2499.99  North America    Credit Card
7           2      599.99        1199.98         Europe         PayPal
8           6       89.99         539.94           Asia     Debit Card
9           2       25.99          51.98  North America    Credit Card

In [29]:
df.tail()  # Display the last few rows of the DataFrame

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [30]:
#accessing data from dataframe
data

[{'Name': 'Alice', 'Age': 25, 'City': 'New York'},
 {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles'},
 {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago'}]

In [33]:
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [36]:
print(df['Name'])  # Accessing a single column by name
type(df['Name'])  # This will return a Series

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

pandas.core.series.Series

In [ ]:
df.loc[0]  # Accessing the first row by index

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [38]:
df.iloc[0]  # Accessing the first row by index using iloc

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [41]:
df.loc[0][0]

C:\Users\user\AppData\Local\Temp\ipykernel_10224\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Alice'

In [42]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [44]:
df.at[1,'Name']

'Bob'

In [45]:
#accessin gspecific index using iat

df.iat[2,2]

'Chicago'

##### data manipualtion with dataframes

In [46]:
df['salary'] = [50000, 60000, 70000]  # Adding a new column
print(df)

      Name  Age         City  salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [51]:
#removing a column
df.drop('salary',axis=1 , inplace= True )

In [52]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [56]:
#add age in age col

df['Age'] = df['Age']+1 
df

      Name  Age         City
0    Alice   29     New York
1      Bob   34  Los Angeles
2  Charlie   39      Chicago

In [57]:
df

      Name  Age         City
0    Alice   29     New York
1      Bob   34  Los Angeles
2  Charlie   39      Chicago

In [60]:
df.drop(0,inplace=True)  # Dropping the first row

In [61]:
df

      Name  Age         City
1      Bob   34  Los Angeles
2  Charlie   39      Chicago

In [62]:
#datatypes in df

print(df.dtypes)

Name    object
Age      int64
City    object
dtype: object

In [63]:
#describe the dataFrame
df.describe()

             Age
count   2.000000
mean   36.500000
std     3.535534
min    34.000000
25%    35.250000
50%    36.500000
75%    37.750000
max    39.000000

In [66]:
#group by col and perform aggregation
grouped = df.groupby('City')['Value'].mean()  # Grouping by 'City' and calculating the mean of numeric columns

KeyError: 'Column not found: Value'